pats-drones/esp32-camera/sensors/ov5640.c
    ESP_LOGD(TAG, "Set Image Options: Compression: %u, Binning: %u, V-Flip: %u, H-Mirror: %u, Reg-4514: 0x%02x",
             sensor->pixformat == PIXFORMAT_JPEG, sensor->status.binning, sensor->status.vflip, sensor->status.hmirror, reg4514);
    return ret;
}
#define OV5640_CMD_MAIN					0x3022
#define OV5640_CMD_ACK					0x3023
#define OV5640_CMD_FW_STATUS				0x3029
static int ov5640_af_fw_status(sensor_t *sensor)
{
    uint8_t af_st = 0;
    af_st = read_reg(sensor->slv_addr, OV5640_CMD_FW_STATUS);
    return (int)af_st;
}

static int ov5640_af_release(sensor_t *sensor)
{
    int ret = 0;
    ret = write_reg(sensor->slv_addr, OV5640_CMD_ACK, 0x01);
    if (ret)
        return ret;
    ret = write_reg(sensor->slv_addr, OV5640_CMD_MAIN, 0x08);
    if (ret)
        return ret;
    ov5640_af_fw_status(sensor);
    return ret;
}

static int ov5640_af_ack(sensor_t *sensor, int num_trys)
{
    int ret = 0;
    uint8_t af_ack = 0;
    int i;
    for (i = 0; i < num_trys; i++) {
        af_ack = read_reg(sensor->slv_addr, OV5640_CMD_ACK);
        if (af_ack == 0)
            break;
        vTaskDelay(50/portTICK_PERIOD_MS);
    }
    if (af_ack != 0) {
        ESP_LOGW(TAG, "af ack failed\n");
        return OV5640_AF_FAIL;
    }
    return ret;
}

#define AF_SET_VCM_STEP 0x1a

#define AF_CMD_MAIN_REG                     0x3022  // main command, W
#define AF_CMD_ACK_REG                      0x3023  // ACK of command, R/W
#define AF_CMD_PARA0_REG                    0x3024  // Parameter: Byte 0, R/W
#define AF_CMD_PARA1_REG                    0x3025  // Parameter: Byte 1, R/W
#define AF_CMD_PARA2_REG                    0x3026  // Parameter: Byte 2, R/W
#define AF_CMD_PARA3_REG                    0x3027  // Parameter: Byte 3, R/W
#define AF_CMD_PARA4_REG                    0x3028  // Parameter: Byte 4, R/W
#define AF_FW_STATUS_REG                    0x3029  // Status of focus, R

static int ov5640_af_set_vcm_step(sensor_t *sensor, uint8_t step)
{
    int retval = 0;
    retval |= write_reg(sensor->slv_addr, AF_CMD_PARA3_REG, 0x0);
    retval |= write_reg(sensor->slv_addr, AF_CMD_PARA4_REG, step);
    retval |= write_reg(sensor->slv_addr, AF_CMD_ACK_REG, 0x01);
    retval |= write_reg(sensor->slv_addr, AF_CMD_MAIN_REG, AF_SET_VCM_STEP);

    retval |= ov5640_af_ack(sensor, 5);
    if (retval) {
        ESP_LOGW(TAG, "set ov5640_af_set_vcm_step failed\n");
        return OV5640_AF_FAIL;
    }
    int af_st = ov5640_af_fw_status(sensor);
    ESP_LOGW(TAG, "%d\n", af_st);

    // if (af_st != 0x10) {
    //     ESP_LOGW(TAG, "focus pending\n");
    //     ret = OV5640_AF_PENDING;
    // }
    return retval;
}

static int ov5640_af_start(sensor_t *sensor, int num_trys)
{

    ESP_LOGW(TAG, "ov5640_af_reinit\n");

    write_reg(sensor->slv_addr, OV5640_CMD_ACK, 0x01);
    write_reg(sensor->slv_addr, OV5640_CMD_MAIN, 0x12);
    int ret = ov5640_af_ack(sensor, num_trys);
    if (ret) {
        ESP_LOGW(TAG, "set af1 failed\n");
        return OV5640_AF_FAIL;
    }


    write_reg(sensor->slv_addr, OV5640_CMD_ACK, 0x01);
    write_reg(sensor->slv_addr, OV5640_CMD_MAIN, 0x80);
    ret = ov5640_af_ack(sensor, num_trys);
    if (ret) {
        ESP_LOGW(TAG, "set af2 failed\n");
        return OV5640_AF_FAIL;
    }

    write_reg(sensor->slv_addr, OV5640_CMD_ACK, 0x01);
    // write_reg(sensor->slv_addr, OV5640_CMD_MAIN, 0x04);
    write_reg(sensor->slv_addr, OV5640_CMD_MAIN, 0x03 );
    ret = ov5640_af_ack(sensor, num_trys);
    if (ret) {
        ESP_LOGW(TAG, "set af3 failed\n");
        return OV5640_AF_FAIL;
    }


    return OV5640_AF_SUCCESS;
}

static int ov5640_af_status(sensor_t *sensor, int num_trys)
{
    int ret = OV5640_AF_SUCCESS;
    // struct ov5640 *ov5640 = to_ov5640(client);
    int af_st = 0;
    uint8_t af_zone0, af_zone1, af_zone2, af_zone3, af_zone4;
    // if (ov5640->focus_mode == V4L2_AUTO_FOCUS_RANGE_AUTO)
    {
        /* Check if Focused */
        af_st = ov5640_af_fw_status(sensor);
        ESP_LOGW(TAG, "%d\n", af_st);

        if (af_st != 0x10) {
            ESP_LOGW(TAG, "focus pending\n");
            ret = OV5640_AF_PENDING;
            goto out;
        }
        /* Check if Zones Focused */
        write_reg(sensor->slv_addr, OV5640_CMD_ACK, 0x01);
        write_reg(sensor->slv_addr, OV5640_CMD_MAIN, 0x07);
        ret = ov5640_af_ack(sensor, num_trys);
        if (ret) {
            ESP_LOGW(TAG, "zones ack failed\n");
            ret = OV5640_AF_FAIL;
            goto out;
        }
        af_zone0 = read_reg(sensor->slv_addr, 0x3024);
        af_zone1 = read_reg(sensor->slv_addr, 0x3025);
        af_zone2 = read_reg(sensor->slv_addr, 0x3026);
        af_zone3 = read_reg(sensor->slv_addr, 0x3027);
        af_zone4 = read_reg(sensor->slv_addr, 0x3028);
        if ((af_zone0 != 0) && (af_zone1 != 0) && (af_zone2 != 0)
                && (af_zone3 != 0) && (af_zone4 != 0)) {
            ESP_LOGW(TAG, "zones failed\n");
            ret = OV5640_AF_FAIL;
            ESP_LOGW(TAG,"zones failed");
            goto out;
        }
    }
out:
    return ret;
}
#define SYSTEM_RESET_00     0x3000
#define S_IDLE     0x70
static int set_afw(sensor_t *sensor, bool enable)
{

    static int first = 1;
    static uint8_t focus = 0;
    if (!first) {
        ov5640_af_set_vcm_step(sensor, focus);
        focus += 10;
        return 0;
    }
    first = 0;


    ov5640_af_release(sensor);


    sensor_t *s = sensor;
    const struct reg_value * firmware_regs;
    firmware_regs = ov5640_setting_init_embedded_firmware;
    for (int i = 0; i < sizeof(ov5640_setting_init_embedded_firmware)/sizeof(ov5640_setting_init_embedded_firmware[0]); ++i, ++firmware_regs)
    {
//ov5642_write_reg(firmware_regs->u16RegAddr,firmware_regs->u8Val);
        // ESP_LOGI(TAG, "reg: %d", i);

        s->set_reg(s,firmware_regs->reg,0xff,firmware_regs->val);
    }

    int af_st = ov5640_af_fw_status(sensor);
    ESP_LOGW(TAG, "%d\n", af_st);

    if (af_st != S_IDLE) {
        ESP_LOGW(TAG, "init pending\n");
        // ret = OV5640_AF_PENDING;
    }


    // // set autofocus preview framerae
    // s->set_reg(s,0x3035,0x11);
    // s->set_reg(s,0x3036,0x69);



