pats-drones/esp32-camera/sensors/ov5640.c
    // s->set_reg(s,0x3000,0x60,0x0);
    // s->set_reg(s,0x3004,0x60,0x60);
    // s->set_reg(s,0x3001,0x40,0x0);
    // s->set_reg(s,0x3005,0x40,0x40);

    // int ret;

    // ret |= cambus_writeb2(&sensor->bus, sensor->slv_addr, SYSTEM_RESET_00, 0x20); // force mcu reset

    // // Write firmware
    // uint16_t fw_addr = __REV16(MCU_FIRMWARE_BASE);
    // ret |= cambus_write_bytes(&sensor->bus, sensor->slv_addr, (uint8_t *) &fw_addr, 2, CAMBUS_XFER_SUSPEND);
    // ret |= cambus_write_bytes(&sensor->bus, sensor->slv_addr, (uint8_t *) af_firmware_regs, sizeof(af_firmware_regs), CAMBUS_XFER_NO_FLAGS);

    // for (int i = 0; af_firmware_command_regs[i][0]; i++) {
    //     ret |= cambus_writeb2(&sensor->bus, sensor->slv_addr, (af_firmware_command_regs[i][0] << 8) | (af_firmware_command_regs[i][1] << 0), af_firmware_command_regs[i][2]);
    // }

    // ret |= cambus_writeb2(&sensor->bus, sensor->slv_addr, SYSTEM_RESET_00, 0x00); // release mcu reset
    /*
    ESP_LOGW(TAG, "A");

    // write_reg(sensor->slv_addr, 0x3005, (enable << 6));
    int ret = 0;
    uint8_t reg;
    ret = ov5640_af_release(sensor);
    if (ret)
        return ret;

    ESP_LOGW(TAG, "B");
    //  move VCM all way out
    reg = read_reg(sensor->slv_addr, 0x3603);
    if (ret)
        return ret;

    ESP_LOGW(TAG, "C");
    reg &= ~(0x3f);
    ret = write_reg(sensor->slv_addr, 0x3603, reg);
    if (ret)
        return ret;

    ESP_LOGW(TAG, "D");
    reg = read_reg(sensor->slv_addr, 0x3602);
    if (ret)
        return ret;
    reg &= ~(0xf0);
    ret = write_reg(sensor->slv_addr, 0x3602, reg);

    ESP_LOGW(TAG, "E");
    if (ret)
        return ret;
    ? set direct mode
    reg = read_reg(sensor->slv_addr, 0x3602);

    ESP_LOGW(TAG, "F");
    if (ret)
        return ret;
    reg &= ~(0x07);
    ret = write_reg(sensor->slv_addr, 0x3602, reg);

    ESP_LOGW(TAG, "G");
    if (ret)
        return ret;

    ESP_LOGW(TAG, "H");


    reg = read_reg(sensor->slv_addr, ISP_CONTROL_03);
    reg |= (enable << 1);
    write_reg(sensor->slv_addr, ISP_CONTROL_03, reg);

    vTaskDelay(100);
    */
    ov5640_af_start(sensor,0);

    vTaskDelay(100);

    while (ov5640_af_status(sensor, 5) == OV5640_AF_PENDING)
        vTaskDelay(100);

    // return ret;

    return 0;
// return write_reg(sensor->slv_addr, ISP_CONTROL_03, (enable << 1));

// return write_reg_bits(sensor->slv_addr, ISP_CONTROL_043, 0x08, enable);
}

static int set_framesize(sensor_t *sensor, framesize_t framesize)
{
    int ret = 0;
    framesize_t old_framesize = sensor->status.framesize;
    sensor->status.framesize = framesize;

    if(framesize > FRAMESIZE_QSXGA) {
        ESP_LOGE(TAG, "Invalid framesize: %u", framesize);
        return -1;
    }
    uint16_t w = resolution[framesize].width;
    uint16_t h = resolution[framesize].height;
    aspect_ratio_t ratio = resolution[framesize].aspect_ratio;
    ratio_settings_t settings = ratio_table[ratio];

    sensor->status.binning = (w <= (settings.max_width / 2) && h <= (settings.max_height / 2));
    sensor->status.scale = !((w == settings.max_width && h == settings.max_height)
                             || (w == (settings.max_width / 2) && h == (settings.max_height / 2)));

    ret  = write_addr_reg(sensor->slv_addr, X_ADDR_ST_H, settings.start_x, settings.start_y)
           || write_addr_reg(sensor->slv_addr, X_ADDR_END_H, settings.end_x, settings.end_y)
           || write_addr_reg(sensor->slv_addr, X_OUTPUT_SIZE_H, w, h);

    if (ret) {
        goto fail;
    }

    if (!sensor->status.binning) {
        ret  = write_addr_reg(sensor->slv_addr, X_TOTAL_SIZE_H, settings.total_x, settings.total_y)
               || write_addr_reg(sensor->slv_addr, X_OFFSET_H, settings.offset_x, settings.offset_y);
    } else {
        if (w > 920) {
            ret = write_addr_reg(sensor->slv_addr, X_TOTAL_SIZE_H, settings.total_x - 200, settings.total_y / 2);
        } else {
            ret = write_addr_reg(sensor->slv_addr, X_TOTAL_SIZE_H, 2060, settings.total_y / 2);
        }
        if (ret == 0) {
            ret = write_addr_reg(sensor->slv_addr, X_OFFSET_H, settings.offset_x / 2, settings.offset_y / 2);
        }
    }

    if (ret == 0) {
        ret = write_reg_bits(sensor->slv_addr, ISP_CONTROL_01, 0x20, sensor->status.scale);
    }

    if (ret == 0) {
        ret = set_image_options(sensor);
    }

    if (ret) {
        goto fail;
    }

    if (sensor->pixformat == PIXFORMAT_JPEG) {
        //10MHz PCLK
        uint8_t sys_mul = 200;
        if(framesize < FRAMESIZE_QVGA || sensor->xclk_freq_hz == 16000000) {
            sys_mul = 160;
        } else if(framesize < FRAMESIZE_XGA) {
            sys_mul = 180;
        }
        ret = set_pll(sensor, false, sys_mul, 4, 2, false, 2, true, 4);
        //Set PLL: bypass: 0, multiplier: sys_mul, sys_div: 4, pre_div: 2, root_2x: 0, pclk_root_div: 2, pclk_manual: 1, pclk_div: 4
    } else {
        //ret = set_pll(sensor, false, 8, 1, 1, false, 1, true, 4);
        if (framesize > FRAMESIZE_HVGA) {
            ret = set_pll(sensor, false, 10, 1, 2, false, 1, true, 2);
        } else if (framesize >= FRAMESIZE_QVGA) {
            ret = set_pll(sensor, false, 8, 1, 1, false, 1, true, 4);
        } else {
            ret = set_pll(sensor, false, 20, 1, 1, false, 1, true, 8);
        }
    }

    if (ret == 0) {
        ESP_LOGD(TAG, "Set framesize to: %ux%u", w, h);
    }
    return ret;

fail:
    sensor->status.framesize = old_framesize;
    ESP_LOGE(TAG, "Setting framesize to: %ux%u failed", w, h);
    return ret;
}

static int set_hmirror(sensor_t *sensor, int enable)
{
    int ret = 0;
    sensor->status.hmirror = enable;
    ret = set_image_options(sensor);
    if (ret == 0) {
        ESP_LOGD(TAG, "Set h-mirror to: %d", enable);
    }
    return ret;
}

static int set_vflip(sensor_t *sensor, int enable)
{
    int ret = 0;
    sensor->status.vflip = enable;
    ret = set_image_options(sensor);
    if (ret == 0) {
        ESP_LOGD(TAG, "Set v-flip to: %d", enable);
    }
    return ret;
}

static int set_quality(sensor_t *sensor, int qs)
{
    int ret = 0;
    ret = write_reg(sensor->slv_addr, COMPRESSION_CTRL07, qs & 0x3f);
    if (ret == 0) {
        sensor->status.quality = qs;
        ESP_LOGD(TAG, "Set quality to: %d", qs);
    }
    return ret;
}

static int set_colorbar(sensor_t *sensor, int enable)
{
    int ret = 0;
    ret = write_reg_bits(sensor->slv_addr, PRE_ISP_TEST_SETTING_1, TEST_COLOR_BAR, enable);
    if (ret == 0) {
        sensor->status.colorbar = enable;
        ESP_LOGD(TAG, "Set colorbar to: %d", enable);
    }
    return ret;
}

static int set_gain_ctrl(sensor_t *sensor, int enable)
{
    int ret = 0;
    ret = write_reg_bits(sensor->slv_addr, AEC_PK_MANUAL, AEC_PK_MANUAL_AGC_MANUALEN, !enable);
    if (ret == 0) {
        ESP_LOGD(TAG, "Set gain_ctrl to: %d", enable);
        sensor->status.agc = enable;
    }
    return ret;
}

